In [1]:
import pandas as pd

In [50]:
all_tables = pd.read_html('https://en.wikipedia.org/wiki/2022_FIFA_World_Cup')

In [51]:
all_tables[9]
all_tables[16]
all_tables[23]
all_tables[58]

   Pos      Teamvte  Pld  W  D  L  GF  GA  GD  Pts               Qualification
0    1     Portugal    3  2  0  1   6   4  +2    6  Advanced to knockout stage
1    2  South Korea    3  1  1  1   4   4   0    4  Advanced to knockout stage
2    3      Uruguay    3  1  1  1   2   2   0    4                         NaN
3    4        Ghana    3  1  0  2   5   7  −2    3                         NaN

In [52]:
for table in range(9, 59, 7):
    print(table)

9
16
23
30
37
44
51
58

In [53]:
from string import ascii_uppercase as alphabet

In [54]:
alphabet

'ABCDEFGHIJKLMNOPQRSTUVWXYZ'

In [55]:
for letter,table in zip(alphabet,range(9, 59, 7)):
    print(letter,table)

A 9
B 16
C 23
D 30
E 37
F 44
G 51
H 58

In [56]:
dict_table = {}

for letter,table in zip(alphabet,range(9, 59, 7)):
    df = all_tables[table]
    df.rename(columns = {'Teamvte' : 'Team'}, inplace = True)
    df.pop('Qualification')
    dict_table[f'Group {letter}'] = df
    print(letter,table)

A 9
B 16
C 23
D 30
E 37
F 44
G 51
H 58

In [57]:
dict_table.keys()

dict_keys(['Group A', 'Group B', 'Group C', 'Group D', 'Group E', 'Group F', 'Group G', 'Group H'])

In [58]:
dict_table['Group A']

   Pos         Team  Pld  W  D  L  GF  GA  GD  Pts
0    1  Netherlands    3  2  1  0   5   1  +4    7
1    2      Senegal    3  2  0  1   5   4  +1    6
2    3      Ecuador    3  1  1  1   4   3  +1    4
3    4    Qatar (H)    3  0  0  3   1   7  −6    0

In [59]:
dict_table['Group H']

   Pos         Team  Pld  W  D  L  GF  GA  GD  Pts
0    1     Portugal    3  2  0  1   6   4  +2    6
1    2  South Korea    3  1  1  1   4   4   0    4
2    3      Uruguay    3  1  1  1   2   2   0    4
3    4        Ghana    3  1  0  2   5   7  −2    3

In [61]:
import pickle

In [62]:
with open('dict_table', 'wb') as output:
    pickle.dump(dict_table, output)